#+title: Teoría de los lenguajes de programación Ejercicios
#+autor: Jordi Amposta Perez
#+startup: content

* Programación funcional Haskel
** Org Babel Usage
#+name: haskell-compile-hello-world
#+begin_src haskell :compile yes :results output
main :: IO ()
main = putStrLn  "Hello world!"
#+end_src

#+RESULTS: haskell-compile-hello-world
: Hello world!

#+name: haskell-interpret-hello-world
#+begin_src haskell
print "Hello world!"
#+end_src

#+RESULTS: haskell-interpret-hello-world

** Número polidivisible
- Un número es polidivisible si es divisible por si longitud, y además al eliminar la cifra de las unidades vuelve a ser polidivisible.

#+begin_src haskell :compile yes :results output
main :: IO()
  
polidivisible n
  | n <= 0 = False
  | otherwise = ipolidivisible n (long n)
  where
    ipolidivisible _ 1 = True
    ipolidivisible n l = ((mod n l) == 0) && (ipolidivisible (div n 10) (l-1))
    long n
      | n < 10 = 1
      | otherwise = 1 + long (div n 10)


main = putStrLn("Result: " ++ show(polidivisible 1024))
#+end_src

#+RESULTS:
: Result: True

** Reglas de reescritura
- pag 79

#+begin_src haskell :compile yes :results output
main :: IO()

reescribe cad [] = []
reescribe cad ((ent,sal):resto)
  | cad == ent = sal
  | otherwise  = reescribe cad resto

-- r: reglas  
reescritura r [] = []
reescritura r (cad:resto)
  | salida == [] = cad:(reescritura r resto)        -- cad no está dentro de reglas
  | otherwise    = reescritura r (salida ++ resto)  -- salida tiene la traducción
                                                    --  Así si si hay una cadena que se puede
                                                    --  expandir de nuevo esta se expande.
  where
    salida = reescribe cad r

reglas = [("DESPEDIDA", ["ADIOS", "NOS VEMOS"]),
          ("HOLA", ["ENCANTADO"]),
          ("SALUDO", ["HOLA", "QUE TAL?"])]

main = putStrLn(show(reescritura reglas ["SALUDO", "SOY UN PROGRAMA", "DESPEDIDA"]))
#+end_src

#+RESULTS:
: ["ENCANTADO","QUE TAL?","SOY UN PROGRAMA","ADIOS","NOS VEMOS"]

** Números expansivos
- pag 79

#+begin_src haskell
expand [] = []
expand [x] = [1,x]
expand (x:y:ys)
  | x /= y    = 1:x:(expand (y:ys))
  | otherwise = iexpand ys 2 x
  where
    iexpand [] n x = [n,x]
    iexpand (y:ys) n x
      | x /= y   = n:x:(expand (y:ys))
      |otherwise = iexpand ys (n+1) x
#+end_src  

#+RESULTS:
  
** Mergesort
#+begin_src haskell :compile yes :results output
main :: IO()

mergesort :: Ord a => [a] -> [a]
mergesort [] = []
mergesort [x] = [x]
mergesort xs = merge (mergesort left) (mergesort right)
  where
    (left, right) = splitAt (length xs `div` 2) xs
    merge [] ys = ys
    merge xs [] = xs
    merge (x:xs) (y:ys)
      | x <= y = x : merge xs (y:ys)
      | otherwise = y : merge (x:xs) ys

main = putStrLn(show (mergesort [4,3,1,9,61]))
#+end_src

#+RESULTS:
: [1,3,4,9,61]

** Check all list elements are unique
#+begin_src haskell :compile yes :results output
main :: IO()

uniques xs = iuniques (mergesort xs)
  where
    iuniques [x] = True
    iuniques (x:y:xs) = x /= y && iuniques(y:xs)
    mergesort :: Ord a => [a] -> [a]
    mergesort [] = []
    mergesort [x] = [x]
    mergesort xs = merge (mergesort left) (mergesort right)
      where
        (left, right) = splitAt (length xs `div` 2) xs    -- `` infix form

        merge [] ys = ys
        merge xs [] = xs
        merge (x:xs) (y:ys)
          | x <= y = x : merge xs (y:ys)
          | otherwise = y : merge (x:xs) ys
  
main = putStrLn(show(uniques [1,3,2,3,4]))
#+end_src

#+RESULTS:
: False

** List Elements Comparison

#+begin_src haskell :compile yes :results output
main :: IO()

listcomp :: (Num a1, Ord a1, Ord a2) => [a2] -> [a1] -> Bool

listcomp _ [] = True
listcomp (x:y:xs) (c:cs)
  | c < 0 = x < y && listcomp (y:xs) cs
  | c > 0 = x > y && listcomp (y:xs) cs
  | otherwise = listcomp (y:xs) cs

main = putStrLn(show(listcomp [3,1,2] [1,-1]))
#+end_src

#+RESULTS:
: True

** Get matrix column as a list

#+begin_src haskell :compile yes :results output
main :: IO()

arrcol [] _ = []
arrcol (xl:xs) n = (checkl xl n) : arrcol xs n
  where
    checkl [] _ = -1
    checkl (x:xs) n
      | n == 0 = x
      | otherwise = checkl xs (n-1)

main = putStrLn(show(arrcol [[1,2,4],[8,4,0,0,2,4],[1,2,4]] 9))
#+end_src

#+RESULTS:
: [-1,-1,-1]

** Set Item in a list

#+begin_src haskell :compile yes :results output
main :: IO()
  
setListItem [] _ _ = []
setListItem (x:xs) v n 
  | n == 0 = v:xs
  | otherwise = x : setListItem xs v (n-1)

main = putStrLn(show(setListItem [1,2,3,4,5] (-1) 1))
#+end_src

#+RESULTS:
: [1,-1,3,4,5]

** Set Item in Array

#+begin_src haskell :compile yes :results output
main :: IO()

setArrayItem [] _ _ _ = []
setArrayItem (r:rs) v rw cl
  | rw == 0 = setListItem r v cl : rs
  | otherwise = r : setArrayItem rs v (rw-1) cl
  where
      setListItem [] _ _ = []
      setListItem (x:xs) v n 
        | n == 0 = v:xs
        | otherwise = x : setListItem xs v (n-1)

main = putStrLn(show(setArrayItem [[1,2,3],[4,5,6],[7,8,9]] (-1) 1 1))
#+end_src

#+RESULTS:
: [[1,2,3],[4,-1,6],[7,8,9]]

** Is Present in a unordered list
#+begin_src haskell :compile yes :results output
main :: IO()

isPresent [] _ = False
isPresent (x:xs) v
  | x == v = True
  | otherwise = isPresent xs v

main = putStrLn(show(isPresent [1,2,3,4] 22))
#+end_src

#+RESULTS:
: False

** Get Matrix Coordinates
#+begin_src haskell :compile yes :results output
main :: IO()

-- coordsFirstMatch :: forall a. [[a]] -> a -> [a]

coordsFirstMatch m v = icoords m v 0
  where
    icoords [] _ _ = [-1,-1]
    icoords (x:xs) v rw
      | colIdx /= -1 = [rw, colIdx]
      | otherwise = icoords xs v (rw + 1)
      where
        colIdx = getIndx x v 0

    getIndx [] _ _ = -1
    getIndx (x:xs) v cl
      | x == v
      = cl
      | otherwise = getIndx xs v (cl+1)

main = putStrLn(show(coordsFirstMatch [[1,2,3],[1,0,9],[7,8,9]] 0))
#+end_src

#+RESULTS:
: [1,1]

* Sandbox

#+begin_src haskell :compile yes :results output
main :: IO()

sorted [x] = True
-- sorted (x..) = True  -- infinite structures ?
sorted (x:y:xs) = x <= y && sorted (y:xs)

main = putStrLn(show(sorted [1,2,3,4,5]))
#+end_src

#+RESULTS:
: True

#+RESULTS
: True

#+begin_src haskell :compile yes :results output
main :: IO()

successors [] = []
successors c = map (isuccessors c) [1..9]
  where
    isuccessors (x:xs) v
      | contains x 0 = (replace x 0 v):xs
      | otherwise = x : isuccessors xs v

    contains [] _ = False
    contains (x:xs) v
      | x == v = True
      | otherwise = contains xs v

    replace [] _ _ = []
    replace (x:xs) v r
      | x == v = r:xs
      | otherwise = x : replace xs v r

main = putStrLn(show(successors [[1,2,3],[0,0,0],[0,0,0]]))
#+end_src

#+RESULTS:
: [[[1,2,3],[1,0,0],[0,0,0]],[[1,2,3],[2,0,0],[0,0,0]],[[1,2,3],[3,0,0],[0,0,0]],[[1,2,3],[4,0,0],[0,0,0]],[[1,2,3],[5,0,0],[0,0,0]],[[1,2,3],[6,0,0],[0,0,0]],[[1,2,3],[7,0,0],[0,0,0]],[[1,2,3],[8,0,0],[0,0,0]],[[1,2,3],[9,0,0],[0,0,0]]]

#+begin_src haskell :compile yes :results output
main :: IO()

tfn a b = a+b

main = putStrLn(show(map (tfn 3) [1..9]))
#+end_src

#+RESULTS:
: [4,5,6,7,8,9,10,11,12]

